backend/app/jobs/generate_review_job.rb

  def perform(product_id)
    product = Product.find(product_id)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]