backend/app/services/review_generator_service.rb

INSERT INTO "reviews" ("product_id", "content", "compared_products", "rating", "generation_status", "error_message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def call
    begin
      similar_products = @product.similar_products(3)

      prompt = build_prompt(similar_products)

      client = OpenAI::Client.new(
        api_key: ENV["OPENAI_API_KEY"]
      )

      response = client.responses.create(
        model: ENV['OPENAI_MODEL'] || "gpt-3.5-turbo",
        input: prompt
      )

      content = response.output_text

      if content.blank?
        raise "OpenAI returned empty content"
      end

      rating = extract_rating(content)

      review = Review.create!(
        product: @product,
        content: content,
        compared_products: similar_products.map(&:id),
        rating: rating,
        generation_status: 'completed'
      )

INSERT INTO "reviews" ("product_id", "content", "compared_products", "rating", "generation_status", "error_message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      end

      # For other errors, create a failed review record
      review = Review.create!(
        product: @product,
        content: "Review generation failed. Error: #{e.message}",
        compared_products: [],
        rating: nil,
        generation_status: 'failed',
        error_message: e.message
      )