backend/app/controllers/api/v1/articles_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def generate
    if @product
      result = ReviewGeneratorService.new(@product).call
    else
      # Handle case when called without product_id
      product_id = params[:product_id] || params.dig(:article, :product_id)
      if product_id
        product = Product.find(product_id)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_product
    if params[:product_id]
      @product = Product.find(params[:product_id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def set_article
    @article = Review.find(params[:id])