backend/app/controllers/api/v1/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "description", "category", "price", "brand", "specifications", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "category" = $1, "image_url" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["category", "Home"], ["image_url", "https://m.media-amazon.com/images/I/41xbXgf1FUL._SL500_.jpg"], ["updated_at", "2026-01-27 15:22:55.869819"], ["id", 4]]